Revit 2027 API
FabricationPart.GetInsulationLiningGeometry Method
 Gets insulation and lining geometry for this fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GeometryElement GetInsulationLiningGeometry()
Public Function GetInsulationLiningGeometry As GeometryElement
public:
GeometryElement^ GetInsulationLiningGeometry()
member GetInsulationLiningGeometry : unit -> GeometryElement
Return Value
GeometryElement
 Returns any insulation and liner geometry.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace